{"pageProps":{"post":{"title":"Flowkey Sheet Music Scraper","date":"2019-12-27T20:45:16.000Z","slug":"2019/2019-12-27-flowkey-sheet-music","content":"<p>Note: This post mentions the paid service flowkey, it is not sponsored in any way - I just really like it! Also, I am not sure if this breaks their TOS but I am not wanting to abuse their service - just to help me learn a few songs here and there.</p>\n<h2>Learning Piano with Flowkey</h2>\n<p>Recently, I got a piano to play as a new hobby. It has been great learning to play and having a new creative outlet for when I need it. Since it had been about 15 years since I last played, I needed a way to learn. Luckily, I found a site/app called <a href=\"https://flowkey.com/\">flowkey</a>.</p>\n<p><img src=\"/assets/img/blog/2019/flowkey/flowkey.png\" alt=\"flowkey\"></p>\n<p>Flowkey works by connecting a computer or mobile device via MIDI or listening with a microphone. As you play the different notes, it moves along the sheet music. Until you correctly play the right notes, it will not continue moving along the music. If you are learning piano, definitely take a look at it - it's quite reasonable. There are a whole bunch of songs to learn at your own pace and they also have some lessons as well.</p>\n<h2>Getting Sheet Music</h2>\n<p>Although flowkey is great for learning music, you can't print the sheet music by itself. Having the entire music in front of you without needing an app is quite useful for mastering a song without any help. Of course, since it is a webapp I started digging.</p>\n<p>I found quickly that the music is served as a series of images to the browser. I started writing a script to grab the images and stitch them together. After I had and started looking at each image, I found they are not necessarily split by meausure but instead at a fixed pixel value.</p>\n<p>Trying to make sheet music as you would see it in the wild reuires breaks in the music every few measures, similar to a paragraph with words and wrapping along between lines.</p>\n<h2>Parsing the Image</h2>\n<p>Luckily there are ways to turn images into music! I found an open source program called <a href=\"https://github.com/Audiveris/audiveris\">audiveris</a> which does Optical Music Recognition (OMR), which similar to OCR allows images to be converted into sheet music. The sheet music is stored in the <a href=\"http://www.musicxml.com/\">MusicXML</a> format - an open standard for storing sheet music.</p>\n<p>The parsed music is surprisingly accurate and with a few small tweaks can be an exact duplicate. I use a service called <a href=\"https://www.noteflight.com/\">noteflight</a> to fix up the music and then to export.</p>\n<h2>The <a href=\"https://gist.github.com/amcolash/433421a9a729ef42461b48bd006c50af\">Code</a></h2>\n<p>Now that I have explained a bit about the the problem and how I got here, here is a <a href=\"https://gist.github.com/amcolash/433421a9a729ef42461b48bd006c50af\">gist</a>. With the code I have used. The file <code>flowkey.js</code> is used to grab the base url from flowkey (just paste it into your js debugger console). After running that, you will need to run <code>noteflight.sh</code> which grabs the images, stiches them, runs audiveris and finally tries to open noteflight.</p>\n<p>Hopefully the code has enough comments inline to explain the process!</p>\n"}},"__N_SSG":true}