{"pageProps":{"post":{"title":"If It Ain't Broke, Don't Fix It!","date":"2019-07-03T03:50:13.000Z","slug":"2019/2019-07-02-if-it-aint-broke-dont-fix-it","content":"<p>Sometimes, I make things too complicated for their own good. Today's post is yet another story of that time when you think you can make a better version of what you have.</p>\n<p>Technology gives us so much in our lives and allows us to do some pretty incredible things. I love all of the cool projects I work on (and open source on my <a href=\"https://github.com/amcolash\">github</a>), and yet sometimes I wonder just how much work is worth it.</p>\n<p>A bit ago, I wrote about looking into new ways to build my website and which fancy new web stack I was looking at. I had decided on Gatsby, but when it turned out to be pretty complicated I switched to react-static. Upon further inspection I decided on next.js. I did a handful of starter tutorials and things were going pretty smoothly - until I wanted to get things working <em>my way</em>.</p>\n<p>I realized that adding in a static blog with markdown files was going to be a bit more work than initially planned on. I spun in circles until tonight when I realized there is no point at all to rewrite the site just yet. I am already using jekyll which is designed specifically for static blogs with markdown. Here is the entire markdown for a blog page with jekyll:</p>\n<pre><code class=\"language-html\">{% raw %} --- layout: page title: Blog permalink: /blog/ ---\n&#x3C;ul class=\"postList\">\n  {% for post in site.posts %}\n  &#x3C;li class=\"post\">\n    &#x3C;span class=\"title\">&#x3C;a href=\"{{ post.url }}\">{{ post.title }}&#x3C;/a>&#x3C;/span>\n    &#x3C;br />\n    &#x3C;span class=\"date\">{{post.date | date_to_string: \"ordinal\", \"US\" }}&#x3C;/span>\n  &#x3C;/li>\n  {% endfor %}\n&#x3C;/ul>\n{% endraw %}\n</code></pre>\n<p>I am going to stick with what I have for now. There are some quirks and not everything is quite how I would prefer it. Even so, it is so much simpler than re-writing for very little (arguably no) benefits. Sure I could use node instead of ruby, but at the end of the day this static site doesn't need react to function or routes or anything fancy. The bundle download includes all css + js in the initial html (which for most pages clocks in around 20-50kb). I am already kicking ass at the page optimization, so why make it more complicated than it needs to be.</p>\n<p>Not everything shiny is so great close up! I love writing code, but rewriting for the sake of a new stack (for a site that is rarely updated) seems like a waste. I do hope to write more blog posts in the future, but since I am already on a great platform for blogging, it is a no-brainer to stay put for now.</p>\n"}},"__N_SSG":true}