{"pageProps":{"post":{"title":"Fixing Audio on EmulationStation","date":"2019-07-05T04:45:06.000Z","slug":"2019/2019-07-07-audio-on-emulationstation","content":"<p>A few days ago, I went over the steps to getting updated software onto my <a href=\"https://www.8bcraft.com/product/retrostone/\">RetroStone</a> retro gaming device. It is linux-based and has internals similar to an OrangePi. Fortunately there is a big open source community for emulating old games and there is some great software called <a href=\"https://retropie.org.uk/\">RetroPie</a> and <a href=\"https://emulationstation.org/\">EmulationStation</a> which set everything up for you.</p>\n<p>After the update, I had a handful of issues and needed to tweak some configurations to get things functioning again. One of my big issues was with a broken audio setup in <code>EmulationStation</code>. The audio menu did not work properly and I kept getting on the error <code>VolumeControl::init() - Failed to find mixer elements!</code> logged to my console. After a lot of searching and trial and error I found directions on the <a href=\"https://github.com/RetroPie/RetroPie-Setup/wiki/Sound-Issues\">retropie wiki</a> which explain how to get the audio set up.</p>\n<p>Unfortunately the update had introduced a new feature that I was not aware of. It now broke up audio devices into devices and mixers - instead of previously just devices. The upgrade did its best effort to get it configured, but the RetroStone apparently has a non-standard audio device setup.</p>\n<p>I needed to edit the file <code>/opt/retropie/configs/all/emulationstation/es_settings.cfg</code> to properly set up the audio card / device (mixer).</p>\n<pre><code class=\"language-xml\">&#x3C;string name=\"AudioCard\" value=\"sysdefault\" />\n&#x3C;string name=\"AudioDevice\" value=\"Lineout volume control\" />\n</code></pre>\n<p>Now that audio was again working in <code>EmulationStation</code>, I thought my work was done. Soon after changing that value however, I started seeing another error <code>ALSA lib pcm.c:7843:(snd_pcm_recover) underrun occurred</code>. Following advice from the reddit post <a href=\"https://www.reddit.com/r/RetroPie/comments/5lo9jj/sound_issues_alsa_underrun_with_usb_audio/dbx6ox6?utm_source=share&#x26;utm_medium=web2x\">here</a>, I got more issues ironed out with audio and emulation station.</p>\n<p>I simply had to edit <code>/etc/asound.conf</code> and change the sound buffer settings:</p>\n<pre><code class=\"language-properties\">period_size = 4096\nbuffer_size = 32768\n</code></pre>\n<p>Now that my audio on the device is working properly, I think that my tweaking is almost done. The last step is going to be working on getting my wifi working more reliably than it currently is.</p>\n"}},"__N_SSG":true}